{
    "itemLocalData": [
        {
            "id": 1,
            "text": "Rivet pack\nA set of rivets that can be shot using a rivet gun."
        },
        {
            "id": 2,
            "text": "Capacitor\nA powerful battery that can fuel energy using weapons."
        },
        {
            "id": 3,
            "text": "Tranquilizer Dart\nSpecial ammunition for the tranquilizer. Causes enemies struck to go berserk."
        },
        {
            "id": 4,
            "text": "Grenade\nGoes boom! Just find a boomstick to go with it."
        },
        {
            "id": 5,
            "text": "Rocket\nAmmunition for missile launcher."
        },
        {
            "id": 6,
            "text": "Scrap\nLocal currency."
        },
        {
            "id": 7,
            "text": "FixKit\nA set of tools and components that can fix damage in robots. Restores 75 health on use."
        },
        {
            "id": 8,
            "text": "Body Plating\nA set of heavy metal plates that can go in torso area. Will make you much more protected from damage but it will also slow you down significantly.\nCan be installed in body module."
        },
        {
            "id": 9,
            "text": "Suspended Body Plating\nComposite armor plates coupled provide superior protection, while powerful actuators ensure no loss of movement speed.\nCan be installed in body module."
        },
        {
            "id": 10,
            "text": "Sensoric Body Module\nThis body set hides many useful tools and sensors. With it's help you can more efficiently salvage useful items from defeated enemies. Also provides small increase in durability.\nCan be installed in body module."
        },
        {
            "id": 11,
            "text": "Head Plating\nA set of heavy plates that form a helmet. After all nobody wants their CPU sticking out from their head after taking a shot. Gives more durability.\nCan be installed in head module."
        },
        {
            "id": 12,
            "text": "Improved Head Plating\nA set of composite armor for the head. Provides a good improvement in durability.\nCan be installed in head module."
        },
        {
            "id": 13,
            "text": "Head Sensors\nA set of sensors and extra CPUs. Helps you think about secrets of the universe. Also will improve how much scrap is generated by defeating enemies.\nCan be installed in head module."
        },
        {
            "id": 14,
            "text": "Arms Plating\nHeavy metal plates that can be installed in your arms. Provides a good boost in protection.\nCan be installed in arms module."
        },
        {
            "id": 15,
            "text": "Improved Arms Plating\nA set of strong but light composite plates that can be installed in your arms. Provides an excellent durability boost at no cost to your speed.\nCan be installed in arms module."
        },
        {
            "id": 16,
            "text": "Sensoric Arms Module\nA set of tools, sensors and possibly extra fingers. When installed, you will be able to open locked containers.\nCan be installed in arms module."
        },
        {
            "id": 17,
            "text": "Legs Plating\nHeavy plates that can be installed in your legs. At a price of slowed movement speed and clumsiness, provide a good boost to durability.\nCan be installed in legs module."
        },
        {
            "id": 18,
            "text": "Actuator Legs Module\nSprings and powerful pistons combined with light composite plating. Gives a small improvement to durability and provides a huge boost to your movement speed.\nCan be installed in legs module."
        },
        {
            "id": 19,
            "text": "Sensoric Legs Module\nA set of extra pipes can deliver more fuel to leg motors and actuators. Provides a small boost to both durability and movement speed.\nCan be installed in legs module."
        },
		{
            "id": 20,
            "text": "Laser Rifle\nUnlike what the name suggest it actually shoots plasma. Lasers would hit the enemy instantly. Well, at least projectile speed is still fast!\nThis weapon deals good damage, has high range and good ammo capacity.\nUses capacitors"
        },
		{
            "id": 21,
            "text": "Missile launcher\nShoots a missile that guides onto mouse pointer location. The missile starts slow but accelerates over time.\nExcellent damage and range.\nUses rockets"
        },
		{
            "id": 22,
            "text": "Rivet Gun\nWhile intended to be a tool to be used in industry, you can use it as a weapon.\nCan be fired rapidly but has poor damage and accuracy issues.\nUses rivets"
        },
		{
            "id": 23,
            "text": "Taser\nThis pistol creates a large electric sparks that deals solid damage to all enemies it crosses.\nGood damage but poor range.\nUses capacitors"
        },
		{
            "id": 24,
            "text": "Tranquilizer\nThis unique weapon fires a projectile that fries electronics. When hit, the target turns berserk and starts attacking everything around it.\nExpensive and rare weapon.\nUses tranquilizer darts"
        },
		{
            "id": 25,
            "text": "Tube\nIt's actually a grenade launcher. Keep some distance between you and the target!\nDeals huge damage to all targets in small radius of impact.\nUses grenades"
        }
    ]
}
